[
    {
        "page_content": "Aber – und das zu betonen, ist mir wichtig – unsere Haltung speist sich aus ganz anderen Überlegungen, als dies bei der AfD der Fall ist.\n\nAllem voran: Im Gegensatz zur AfD sind wir keine Klimaleugner; wir erkennen an, dass es eine sehr hohe wissenschaftliche und auch empirische Evidenz dafür gibt, dass der Klimawandel menschengemacht ist.\n\nDeshalb müssen wir handeln, auch im Verkehrssektor.\n\nNatürlich gibt es in der Wissenschaft nur selten eine hundertprozentige Sicherheit.",
        "metadata": {
            "id": "ID213411400",
            "date": "16.10.2025",
            "source": "/Users/acb/code/abahss/practice-vs-preach/data/speeches-wahlperiode-21.csv",
            "row": 1147,
            "party": "CDU/CSU"
        }
    },
    {
        "page_content": "Im Gegenteil: Wir verlieren Wohlstand.\n\nIch will es klar sagen: Diesen Weg gehen wir nicht mit.\n\nDann haben wir auf der anderen Seite des Spektrums die AfD.\n\nSie leugnet den Klimawandel komplett und lehnt die Erneuerbaren vollständig ab.\n\nBeide Strategien weisen in die Irre.\n\nDenn sie würden Deutschland entweder ärmer machen oder den Klimawandel beschleunigen.\n\nWas wir stattdessen brauchen, ist eine gute Balance, eine kluge Politik der Mitte.\n\nDafür steht diese Regierung.",
        "metadata": {
            "id": "ID214001600",
            "source": "/Users/acb/code/abahss/practice-vs-preach/data/speeches-wahlperiode-21.csv",
            "party": "CDU/CSU",
            "date": "13.11.2025",
            "row": 343
        }
    },
    {
        "page_content": "Im Gegenteil: Wir verlieren Wohlstand.\n\nIch will es klar sagen: Diesen Weg gehen wir nicht mit.\n\nDann haben wir auf der anderen Seite des Spektrums die AfD.\n\nSie leugnet den Klimawandel komplett und lehnt die Erneuerbaren vollständig ab.\n\nBeide Strategien weisen in die Irre.\n\nDenn sie würden Deutschland entweder ärmer machen oder den Klimawandel beschleunigen.\n\nWas wir stattdessen brauchen, ist eine gute Balance, eine kluge Politik der Mitte.\n\nDafür steht diese Regierung.",
        "metadata": {
            "id": "ID214001600",
            "row": 442,
            "party": "CDU/CSU",
            "date": "13.11.2025",
            "source": "/Users/acb/code/abahss/practice-vs-preach/data/speeches-wahlperiode-21.csv"
        }
    },
    {
        "page_content": "Für uns Christdemokraten ist klar: Der Klimaschutz hat eine herausragende Bedeutung.\n\nEs geht um den Erhalt der natürlichen Lebensgrundlagen.\n\nUnd es geht darum, dass wir unseren Kindern eine lebens- und liebenswerte Heimat hinterlassen.\n\nIch finde, dieser Gedanke müsste doch eine Motivation sein, die uns alle in diesem Hause parteiübergreifend antreibt, beim Klimaschutz besser zu werden, als wir es heute sind.\n\nWir müssen aber zwei Dinge dabei sehen.",
        "metadata": {
            "date": "17.10.2025",
            "source": "/Users/acb/code/abahss/practice-vs-preach/data/speeches-wahlperiode-21.csv",
            "row": 1017,
            "party": "CDU/CSU",
            "id": "ID213507200"
        }
    },
    {
        "page_content": "Es wird aufgezeigt, dass der Klimawandel ein ernstes Problem ist, dass Effekte eintreten könnten, die Folge des Klimawandels sind, die sich selbst verstärken.\n\nWissenschaftler mahnen uns, dass wir Maßnahmen ergreifen müssen, um den Klimawandel zu begrenzen auf ein Maß, das insgesamt als verantwortbar gilt.\n\nFür uns Christdemokraten ist klar: Der Klimaschutz hat eine herausragende Bedeutung.\n\nEs geht um den Erhalt der natürlichen Lebensgrundlagen.",
        "metadata": {
            "source": "/Users/acb/code/abahss/practice-vs-preach/data/speeches-wahlperiode-21.csv",
            "date": "17.10.2025",
            "id": "ID213507200",
            "party": "CDU/CSU",
            "row": 1017
        }
    },
    {
        "page_content": "Wir stehen zu ambitioniertem Klimaschutz ohne ideologische Scheuklappen und mit Blick auf Akzeptanz und Wirtschaftskraft.\n\nGenau das erwarten die Menschen in unserem Land.\n\nGenau das braucht das Weltklima.\n\nVielen Dank.\n\n– Der nächste Redner ist Karsten Hilse für die AfD-Fraktion.",
        "metadata": {
            "source": "/Users/acb/code/abahss/practice-vs-preach/data/speeches-wahlperiode-21.csv",
            "date": "14.11.2025",
            "party": "CDU/CSU",
            "id": "ID214107900",
            "row": 320
        }
    },
    {
        "page_content": "Wir brauchen auch mehr Pragmatismus und Realismus bei der Umsetzung unserer Klimaziele.\n\nWir dürfen nicht vor Jahreszahlen erstarren.\n\nWir müssen die Ziele im Blick behalten und Klimaschutz global denken, sodass wirtschaftliche Stärke, der starke Sozialstaat und Klimaschutz in Deutschland in Zukunft Hand in Hand gehen.\n\nDaran arbeiten wir gemeinsam mit der SPD, dass wir Deutschland wieder gemeinsam nach vorne bringen.\n\nVielen Dank.",
        "metadata": {
            "source": "/Users/acb/code/abahss/practice-vs-preach/data/speeches-wahlperiode-21.csv",
            "party": "CDU/CSU",
            "date": "16.10.2025",
            "id": "ID213407100",
            "row": 1132
        }
    },
    {
        "page_content": "Genau deshalb haben CDU, CSU und SPD im Koalitionsvertrag festgeschrieben, dass Deutschland auf Kurs bleibt bei den Fragen der Klimaneutralität und bei den europäischen Zielen.\n\nWir verbinden Klimaschutz mit wirtschaftlicher Stärke und mit sozialer Verantwortung.\n\nDieser Dreiklang ist nicht einfach nur eine Phrase, ein Vorwort; er ist die Leitlinie unseres Handelns.",
        "metadata": {
            "id": "ID214108300",
            "party": "CDU/CSU",
            "source": "/Users/acb/code/abahss/practice-vs-preach/data/speeches-wahlperiode-21.csv",
            "row": 321,
            "date": "14.11.2025"
        }
    },
    {
        "page_content": "Die AfD will sämtliche zentralen Klimagesetze streichen, internationale Abkommen kündigen und obendrein das Grundgesetz umschreiben.\n\nKurz gesagt: Sie wollen Deutschland energiepolitisch zurück in die Zeit der Hochöfen und Smogalarme schicken, nur diesmal CO2-neutral, versteht sich.\n\nMeine Damen und Herren, beginnen wir mit dem Versuch, den Klimaschutz aus der Verfassung zu streichen.",
        "metadata": {
            "id": "ID214002100",
            "source": "/Users/acb/code/abahss/practice-vs-preach/data/speeches-wahlperiode-21.csv",
            "date": "13.11.2025",
            "party": "CDU/CSU",
            "row": 443
        }
    },
    {
        "page_content": "Von Klimakollaps und Führungsversagen kann also überhaupt keine Rede sein, verehrte Kolleginnen und Kollegen, vielmehr von unangebrachter Panikmache der grünen Bundestagsfraktion.\n\nSie von Bündnis 90/Die Grünen sollten sich lieber mal an die eigene Nase fassen.\n\nWas haben Sie für den Klimaschutz in der letzten Wahlperiode erreicht?",
        "metadata": {
            "party": "CDU/CSU",
            "id": "ID214107900",
            "date": "14.11.2025",
            "row": 320,
            "source": "/Users/acb/code/abahss/practice-vs-preach/data/speeches-wahlperiode-21.csv"
        }
    }
]